Revit 2024 API
RevitLinkType.GetTopLevelLink Method
Overload List
Name | Description
GetTopLevelLink(Document, ExternalResourceReference)
 Returns the ElementId of the (top-level) linked model with the given ExternalResourceReference.
GetTopLevelLink(Document, ModelPath)
 Returns the ElementId of the (top-level) linked model with the given path.
See Also
RevitLinkType Class
RevitLinkType Members
Autodesk.Revit.DB Namespace